# language: zh-CN
@clean-lower-route
功能:编辑路径界面
  Rule:批量导出
    场景:验证批量导出的提示信息
      假如存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 0
            }]
        }]
      }
      """
      当用户"pe"使用密码"8888"启动上位机
      并且"批量导出"路径时
      那么提示信息为:
      """
      = "导出路径完成！成功：1，失败：0。"
      """

    场景:验证批量导出的文件内容
      假如存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 0
            }]
        }]
      }
      """
      当用户"pe"使用密码"8888"启动上位机
      并且"批量导出"路径时
      那么文件内容为:
      """
      =[
          {
          name: route2.csv,
          info: [
                "StepNum,Chamber,SlotNum,ProcessRcp,IdleInterval,IdleRcp,ShortIdleRcp,PeriodicInterval,PeriodicRcp,SwitchRcp,NormalRcp",
                "1,LA,0,,,,,,,,",
                "1,LB,0,,,,,,,,"
                ]
          }
        ]
      """

  Rule:导出路径
    场景:验证导出路径的提示信息
      假如存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        },{
          "visits": [{
            "station": "LB",
            "slot": 0
          }]
        }]
      }
      """
      并且用户"pe"使用密码"8888"启动上位机
      当"导出"路径"route2"时
      那么提示信息为:
      """
      = "导出路径 route2成功!"
      """

    场景:验证导出路径的文件内容
      假如存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 0
            }]
        }]
      }
      """
      当用户"pe"使用密码"8888"启动上位机
      并且"导出"路径"route2"时
      那么文件内容为:
      """
      =[
          {
          name: route2.csv,
          info: [
                "StepNum,Chamber,SlotNum,ProcessRcp,IdleInterval,IdleRcp,ShortIdleRcp,PeriodicInterval,PeriodicRcp,SwitchRcp,NormalRcp",
                "1,LA,0,,,,,,,,",
                "1,LB,0,,,,,,,,"
                ]
          }
        ]
      """

    场景: 导出路径存在同名文件,导出文件覆盖
      假如在路径"C:\test\Route"存在文件"route2.csv":
        | StepNum | Chamber | SlotNum | ProcessRcp | IdleInterval | IdleRcp | ShortIdleRcp | PeriodicInterval | PeriodicRcp | SwitchRcp | NormalRcp |
        | 1       | LA      | 0       |            |              |         |              |                  |             |           |           |
        | 2       | LA      | 0       |            |              |         |              |                  |             |           |           |
      并且存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        },{
          "visits": [{
            "station": "LB",
            "slot": 0
          }]
        }]
      }
      """
      当用户"pe"使用密码"8888"启动上位机
      并且"导出"路径"route2"覆盖"route2.csv"时
      那么文件内容为:
      """
      =[
          {
          name: route2.csv,
          info: [
                "StepNum,Chamber,SlotNum,ProcessRcp,IdleInterval,IdleRcp,ShortIdleRcp,PeriodicInterval,PeriodicRcp,SwitchRcp,NormalRcp",
                "1,LA,0,,,,,,,,",
                "2,LB,0,,,,,,,,"
                ]
          }
        ]
      """

  Rule:另存为路径
    场景:正确的路径另存为
      假如存在"Route":
      """
      {
        "name": "route2",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        },{
          "visits": [{
            "station": "LB",
            "slot": 0
          }]
        }]
      }
      """
      并且用户"pe"使用密码"8888"启动上位机
      当"route2"另存为"saveAs"时
      那么"saveAs"内容为:
      """
      : [
          {
              腔室: LA,
              步骤: 1,
              槽位: 0,
              配方: "(null)"
          },
          {
              腔室: LB,
              步骤: 2,
              槽位: 0,
              配方: "(null)"
          }
          ...
      ]
      """

    场景: 空路径另存为
      假如用户"pe"使用密码"8888"启动上位机
      并且新建路径"Empty"
      当另存为"Empty"时
      那么提示信息为:
      """
      = 路径为空！
      """

    场景:错误路径另存为
      假如用户"pe"使用密码"8888"启动上位机
      并且新增如下路径"errorRoute":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LA  | 0  |    |
        | 2  | ChC | 0  |    |
      当另存为"Empty"时
      那么显示错误信息为:
      """
      = "请以LB/LA结尾！"
      """

  Rule: 保存路径
    场景: 不选择路径进行保存
      假如用户"pe"使用密码"8888"启动上位机
      当保存路径时
      那么提示信息为:
      """
      ="保存失败，当前路径选择为空！"
      """

    场景: 保存一个正确路径提示保存成功
      假如用户"pe"使用密码"8888"启动上位机
      并且新增如下路径"CorrectRoute":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
        | 2  | LB | 0  |    |
      当保存路径"CorrectRoute"时
      那么提示信息为:
      """
      ="路径 CorrectRoute 保存成功!"
      """

    场景:保存一个空路径
      假如用户"pe"使用密码"8888"启动上位机
      并且新建路径"Empty"
      当保存路径"Empty"时
      那么提示信息为:
      """
      = 路径为空！
      """

    场景:保存一个错误路径
      假如用户"pe"使用密码"8888"启动上位机
      并且新增如下路径"errorRoute":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LA  | 0  |    |
        | 2  | ChC | 0  |    |
      当保存路径"errorRoute"时
      那么显示错误信息为:
      """
      = "请以LB/LA结尾！"
      """

    场景: 保存正确路径验证数据库
      假如用户"pe"使用密码"8888"启动上位机
      并且新增如下路径"CorrectRoute":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
        | 2  | LB | 0  |    |
      当保存路径"CorrectRoute"时
      那么所有"Route"应为:
      """
      : [{
        name: CorrectRoute
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        },{
          "visits": [{
            "station": "LB",
            "slot": 0
          }]
        }]
      }]
      """

  Rule:删除路径
    场景:编辑-路径-删除-正在编辑时点击
      假如存在"Route":
    """
      [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "route1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
      """
      并且用户"pe"使用密码"8888"启动上位机
      当"删除"处于"编辑"状态的"route"时
      那么抛出警告，选择"取消"操作，信息为:
      """
      ="确定删除路径 route?"
      """
      当"删除"处于"编辑"状态的"route"并"确定"时
      那么提示信息为:
      """
        ="路径 route 已经被删除!"
      """
      并且成功删除"route"

    @pvd-lower
    @clean-lower-recipeOnly
    @pvd-ui
    场景:编辑-路径-删除-新建未保存时点击
      假如存在Route为"route":
        | 步骤 | 腔室  | 槽位 | 配方           |
        | 1  | LA  | 0  | /LA/test0;1  |
        | 2  | ChA | 0  | /ChA/test1;1 |
        | 3  | Ch2 | 0  | /Ch2/test2;1 |
        | 4  | Ch3 | 0  | /Ch3/test3;1 |
        | 5  | ChB | 0  | /ChB/test4;1 |
        | 6  | LB  | 0  | /LB/test5;1  |
      当"删除"处于"编辑"状态的"route"并"确定"时
      那么提示信息为:
      """
      = "路径 route 已经被删除!"
      """
      并且成功删除"route"

  Rule:查找路径
    场景:路径查找功能验证-查找框中输入单字符(字母或数字)
      假如存在"Route":
    """
      [{
        "name": "abc",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "abe",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "abc1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 2
            }]
        }]
      }]
      """
      当用户"pe"使用密码"8888"启动上位机
      并且查找"a"时,结果显示如下:
    """
    = [abc,abc1,abe]
    """
      当查找"c"时,结果显示如下:
    """
    =[abc,abc1]
    """
      当查找"1"时,结果显示如下:
    """
    =[abc1]
    """

    场景:路径查找功能验证-查找框输入两个或三个字符(大小写字母)
      假如存在"Route":
    """
      [{
        "name": "Abc",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "abe",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "abc1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 2
            }]
        }]
      }]
      """
      当用户"pe"使用密码"8888"启动上位机
      并且查找"Ab"时,结果显示如下:
    """
    = [Abc,abc1,abe]
    """
      当查找"bc"时,结果显示如下:
    """
    =[Abc,abc1]
    """
      当查找"be"时,结果显示如下:
    """
    =[abe]
    """
      当查找"ac"时,结果显示如下:
    """
    null
    """
      并且清除查找框后,界面显示如下:
    """
    =[Abc,abc1,abe]
    """

    场景:路径查找功能验证-查找框包含特殊字符
      假如存在"Route":
    """
      [{
        "name": "Aa1_-bc",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
      """
      当用户"pe"使用密码"8888"启动上位机
      并且查找"Aa1_-bc"时,结果显示如下:
    """
    = [Aa1_-bc]
    """

  Rule:编辑路径(包含新建路径以及相关复杂场景验证)
    场景:编辑-路径-切换列表-正在编辑已修改未保存时-路径完整-选择不保存
      假如存在"Route":
    """
        [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        }]
      },{
        "name": "route1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
    """
      并且用户"pe"使用密码"8888"启动上位机
      当选择"route"并"编辑"路径参数如下:
        | 左上方标题单元格 | 步骤 | 腔室 | 槽位 | 配方 |
        | 行 0      | 1  | LB | 1  | *  |
      并且选择Route"route1"
      那么抛出警告，选择"否"操作，信息为:
      """
      = '路径：route 尚未保存，是否要保存？'
      """
      并且"route"的路径参数如下:
    """
     =[
        {
          腔室: 'LA',
          步骤: 1,
          左上方标题单元格: '行 0',
          槽位: 0,
          配方: '(null)'
        }...
      ]
    """

    场景:编辑-路径-切换列表-正在编辑已修改未保存时-路径完整-选择保存
      假如存在"Route":
    """
        [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          }]
        }]
      },{
        "name": "route1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
    """
      并且用户"pe"使用密码"8888"启动上位机
      当选择"route"并"编辑"路径参数如下:
        | 左上方标题单元格 | 步骤 | 腔室 | 槽位 | 配方 |
        | 行 0      | 1  | LB | 1  | *  |
      并且选择Route"route1"
      那么抛出警告，选择"是"操作，信息为:
      """
      = '路径：route 尚未保存，是否要保存？'
      """
      并且提示信息为:
    """
    ='路径：route 保存成功！'
    """
      并且"route"的路径参数如下:
    """
     =[
        {
          腔室: 'LB',
          步骤: 1,
          左上方标题单元格: '行 0',
          槽位: 1,
          配方: '(null)'
        }...
      ]
    """

    场景:编辑-路径-未选择任何路径时执行删除,保存,另存为,导出,编辑
      假如存在"Route":
    """
      [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      },{
        "name": "route1",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 1
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
      """
      并且用户"pe"使用密码"8888"启动上位机
      当未选择路径执行"删除"时
      那么执行失败，提示信息如下:
    """
    ="删除失败，当前路径选择为空！"
    """
      当未选择路径执行"保存"时
      那么执行失败，提示信息如下:
    """
    ="保存失败，当前路径选择为空！"
    """
      当未选择路径执行"另存为"时
      那么执行失败，提示信息如下:
    """
    ="另存为失败，当前路径选择为空！"
    """
      当未选择路径执行"导出"时
      那么执行失败，提示信息如下:
    """
    ="导出失败，当前路径选择为空！"
    """
      当未选择路径执行"编辑"时
      那么执行失败，提示信息如下:
    """
    ="请选择要编辑的路径！"
    """

    @pvd-ui
    场景:编辑-路径-新建-未处于创建或编辑状态时点击新建
      当创建路径"route"时
      那么"route"创建成功，且参数列表为空
      当"删除"处于"编辑"状态的"route"并二次"确定"时
      并且"新建"路径"route"并执行"取消"
      那么未成功创建"route"

    场景:编辑-路径-新建-正在编辑已修改未保存时点击-路径完整-选择不保存
      假如存在"Route":
      """
      [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
      """
      并且用户"pe"使用密码"8888"启动上位机
      并且选择"route"并"编辑"路径参数如下:
        | 左上方标题单元格 | 步骤 | 腔室 | 槽位 | 配方 |
        | 行 0      | 1  | LA | 1  | *  |
        | 行 1      | 2  | LB | 0  | *  |
      当"新建""route2"时
      那么抛出警告并且执行"否"，信息为:
      """
      = '当前路径：route 尚未保存，是否要保存？'
      """
      当再次创建"route2"时
      并且"删除"处于"编辑"状态的"route2"并二次"确定"时
      那么"route"的路径参数如下:
      """
       =[
          {
            腔室: 'LA',
            步骤: 1,
            左上方标题单元格: '行 0',
            槽位: 0,
            配方: '(null)'
          },
          {
            腔室: 'LB',
            步骤: 1,
            左上方标题单元格: '行 1',
            槽位: 1,
            配方: '(null)'
          }
          ...
        ]
      """

    场景:编辑-路径-新建-正在编辑已修改未保存时点击-路径完整-选择保存
      假如存在"Route":
      """
      [{
        "name": "route",
        "createtime": "2000-01-01T00:00:00",
        "modifytime": "2000-01-02T00:00:00",
        "steps": [{
          "visits": [{
            "station": "LA",
            "slot": 0
          },{
            "station": "LB",
            "slot": 1
            }]
        }]
      }]
      """
      并且用户"pe"使用密码"8888"启动上位机
      并且选择"route"并"编辑"路径参数如下:
        | 左上方标题单元格 | 步骤 | 腔室 | 槽位 | 配方 |
        | 行 0      | 1  | LA | 1  | *  |
        | 行 1      | 2  | LB | 0  | *  |
      当"新建""route2"时
      那么抛出警告，"确定"后并且二次确认，信息为:
      """
      = '当前路径：route 尚未保存，是否要保存？'
      """
      当再次创建"route2"时
      并且"删除"处于"编辑"状态的"route2"并二次"确定"时
      那么"route"的路径参数如下:
      """
       =[
          {
            腔室: 'LA',
            步骤: 1,
            左上方标题单元格: '行 0',
            槽位: 1,
            配方: '(null)'
          },
          {
            腔室: 'LB',
            步骤: 2,
            左上方标题单元格: '行 1',
            槽位: 0,
            配方: '(null)'
          }
          ...
        ]
      """

    @pvd-lower
    @clean-lower-recipeOnly
    @pvd-ui
    @clean-allCreate-route
    场景:编辑-路径-新建-正在编辑已修改未保存时点击-路径不完整
      假如存在Route为"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LA  | 0  |    |
        | 2  | ChA | 0  |    |
        | 3  | LB  | 0  |    |
      当选择"route"并"编辑"路径参数如下:
        | 左上方标题单元格 | 步骤 |
        | 行 1      | 1  |
      并且"新建""route2"时
      那么抛出警告并且执行"确定"，信息为:
      """
      = '无效路径! 路径必须以“LA”或“LB”开始！ 路径route保存失败！'
      """
      当选择第"1"行后对路径"route"执行编辑的"插入行"操作时
      并且"新建""route2"时
      那么抛出警告，信息如下:
      """
      = '第3行没有编辑完整，请继续编辑完成。'
      """
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 | 腔室  | 槽位 | 配方 |
        | 行 1      | 2  | ChC | 1  | *  |
        | 行 2      | 2  | ChA | 1  | *  |
        | 行 3      | 3  | ChE | 1  | *  |
      并且"新建""route2"时
      那么抛出警告，信息如下:
      """
      = '请以LB/LA结尾！'
      """

    @pvd-lower
    @clean-lower-recipeOnly
    @pvd-ui
    @clean-allCreate-route
    场景:编辑-路径-新建-新建未保存时点击-路径不完整
      假如创建路径"route"时
      当"新建""route2"时
      那么抛出警告并且执行"确定"，信息为:
      """
      = '路径为空！ 路径route保存失败！'
      """
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 0      | 1  |
      并且"新建""route2"时
      那么抛出警告，信息如下:
      """
      = '第1行没有编辑完整，请继续编辑完成。'
      """
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 | 腔室  | 槽位 | 配方 |
        | 行 0      | 1  | LA  | 1  | *  |
        | 行 1      | 2  | ChC | 1  | *  |
        | 行 2      | 3  | ChE | 1  | *  |
      并且"新建""route2"时
      那么抛出警告，信息如下:
      """
      = '请以LB/LA结尾！'
      """

  Rule:编辑route-清除
    @pvd-ui
    @clean-allCreate-route
    场景:取消route的编辑-清除操作
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
      当对路径"route"执行编辑的"清除"操作时
      那么抛出警告，选择"取消"操作，信息为:
       """
      = '确认清除当前路径全部内容？'
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:确定route的编辑-清除操作
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
      当对路径"route"执行编辑的"清除"操作时
      那么抛出警告，选择"确定"操作，信息为:
       """
      = '确认清除当前路径全部内容？'
      """
      并且路径显示如下:
      """
      = [
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 0",槽位: "(null)",配方: "(null)"}
        ]
      """

  Rule:编辑route-删除行
    @pvd-ui
    @clean-allCreate-route
    场景:不选择行时点击删除行
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
      当对路径"route"执行编辑的"删除行"操作时
      那么抛出对话框，信息为:
      """
      = "请选择需要删除的行！"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:选择单元格时点击删除行
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
      当选择单元格"0,槽位"后对路径"route"执行编辑的"删除行"操作时
      那么抛出对话框，信息为:
      """
      = "请选择需要删除的行！"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:删除第一步没有并行步骤的路径的第一行
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LA | 0  |    |
      当选择第"0"行后对路径"route"执行编辑的"删除行"操作时
      那么抛出对话框，信息为:
      """
      = "请不要将第一步全部删除！"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:删除第一步有并行步骤的路径的第一行
      假如存在Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChC | 0  |    |
        | 3  | LA  | 0  |    |
      当选择第"0"行后对路径"route"执行编辑的"删除行"操作时
      那么抛出警告，信息为:
      """
      = "请确认是否删除选中行？"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "ChC", 步骤: 2,左上方标题单元格: "行 1",槽位: 0,配方: "(null)"},
         {腔室: "LA", 步骤: 3,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 3",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:删除路径的非第一步的串行步骤
      假如存在Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChE | 0  |    |
        | 3  | ChC | 0  |    |
        | 4  | LA  | 0  |    |
      当选择第"1"行后对路径"route"执行编辑的"删除行"操作时
      那么抛出警告，信息为:
      """
      = "请确认是否删除选中行？"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "ChC", 步骤: 2,左上方标题单元格: "行 1",槽位: 0,配方: "(null)"},
         {腔室: "LA", 步骤: 3,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 3",槽位: "(null)",配方: "(null)"}
        ]
      """

  Rule:编辑route-插入行
    @pvd-ui
    @clean-allCreate-route
    场景:选择最后一个空行后执行插入行
      假如存在Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LB | 0  |    |
      当选择第"1"行后对路径"route"执行编辑的"插入行"操作时
      那么抛出对话框，信息为:
      """
      = "请不要在最后一行编辑行后插入行"
      """
      并且路径显示如下:
      """
      = [
         {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:选择非最后一个空行的行后执行插入行
      假如存在Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChC | 0  |    |
        | 3  | LB  | 0  |    |
      当选择第"1"行后对路径"route"执行编辑的"插入行"操作时
      并且编辑路径参数并保存:
        | 左上方标题单元格 | 步骤 | 腔室  | 槽位 | 配方 |
        | 行 2      | 3  | ChE | 0  | *  |
      那么路径显示如下:
      """
      = [
        {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "ChC", 步骤: 2,左上方标题单元格: "行 1",槽位: 0,配方: "(null)"},
         {腔室: "ChE", 步骤: 3,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "LB", 步骤: 4,左上方标题单元格: "行 3",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 4",槽位: "(null)",配方: "(null)"}
        ]
      """

  Rule:选择Chamber
    @pvd-ui
    @clean-allCreate-route
    场景:验证VTR2可达到的腔室--从CHA/CHB
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChA | 0  |    |
        | 2  | ChB | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 3      | 3  |
      那么第"3"行的"腔室"返回如下:
      """
      = ["LB","LA","ChE","ChC","Ch2","Ch3"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证VTR2可达到的腔室--从Ch2，串行
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChA | 0  |    |
        | 2  | ChB | 0  |    |
        | 3  | Ch2 | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 4      | 4  |
      那么第"4"行的"腔室"返回如下:
      """
      = ["Ch3","ChA","ChB"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证VTR1可达到的腔室--从LA/LB
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LB | 0  |    |
        | 1  | LA | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 2      | 2  |
      那么第"2"行的"腔室"返回如下:
      """
      = ["ChE","ChC","ChA","ChB"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证VTR1可达到的腔室--从ChE，并行
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChE | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 3      | 2  |
      那么第"3"行的"腔室"返回如下:
      """
      = ["ChC","ChA","ChB"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证VTR1可达到的腔室--从ChE，串行
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChE | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 3      | 3  |
      那么第"3"行的"腔室"返回如下:
      """
      = ["LB","LA","ChC","ChA","ChB"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证第一步可选腔室
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 0      | 1  |
      那么第"0"行的"腔室"返回如下:
      """
      = ["LB","LA"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证第一步可选腔室--并行
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LB | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 1      | 1  |
      那么第"1"行的"腔室"返回如下:
      """
      = ["LA"]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证空白步骤没有可选腔室
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
      那么第"0"行的"腔室"返回如下:
      """
      = []
      """

  Rule:选择Step
    @pvd-ui
    @clean-allCreate-route
    场景:验证在并行步骤之间插入行的步骤
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LB | 0  |    |
        | 1  | LA | 0  |    |
      当选择第"0"行后对路径"route"执行编辑的"插入行"操作时
      那么第"1"行的"步骤"返回如下:
      """
      = [1]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证在串行步骤之间插入行的步骤
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChE | 0  |    |
      当选择第"0"行后对路径"route"执行编辑的"插入行"操作时
      那么第"1"行的"步骤"返回如下:
      """
      = [1,2]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:验证在串行步骤之间插入串行步骤
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 2  | ChE | 0  |    |
      当选择第"0"行后对路径"route"执行编辑的"插入行"操作时
      并且编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 1      | 2  |
      那么路径显示如下:
      """
      = [
         {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: 2,左上方标题单元格: "行 1",槽位: "(null)",配方: "(null)"},
         {腔室: "ChE", 步骤: 3,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 3",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:并行步骤第二个节点步骤
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChE | 0  |    |
      那么第"1"行的"步骤"返回如下:
      """
      = [1,2]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:重新选择并行步骤第二个节点步骤为当前步
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChE | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 1      | 1  |
      那么路径显示如下:
      """
      = [
         {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "LA", 步骤: 1,左上方标题单元格: "行 1",槽位: 0,配方: "(null)"},
         {腔室: "ChE", 步骤: 2,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 3",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:重新选择并行步骤第二个节点步骤为下一步
      假如新建Route"route":
        | 步骤 | 腔室  | 槽位 | 配方 |
        | 1  | LB  | 0  |    |
        | 1  | LA  | 0  |    |
        | 2  | ChE | 0  |    |
      当编辑路径参数:
        | 左上方标题单元格 | 步骤 |
        | 行 1      | 2  |
      那么路径显示如下:
      """
      = [
         {腔室: "LB", 步骤: 1,左上方标题单元格: "行 0",槽位: 0,配方: "(null)"},
         {腔室: "LA", 步骤: 2,左上方标题单元格: "行 1",槽位: 0,配方: "(null)"},
         {腔室: "ChE", 步骤: 3,左上方标题单元格: "行 2",槽位: 0,配方: "(null)"},
         {腔室: "(null)", 步骤: "(null)",左上方标题单元格: "行 3",槽位: "(null)",配方: "(null)"}
        ]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:最后一步(非第一步)可选步骤
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
        | 1  | LB | 0  |    |
      那么第"1"行的"步骤"返回如下:
      """
      = [1,2]
      """

    @pvd-ui
    @clean-allCreate-route
    场景:第一步可选步骤
      假如新建Route"route":
        | 步骤 | 腔室 | 槽位 | 配方 |
      那么第"0"行的"步骤"返回如下:
      """
      = [1]
      """















