# language: zh-CN
@skip
@deactivate-allInterlock
@clean-alarm
@pvd-lower
@pvd-ui
功能:维护界面
  Rule:常规维护操作
    场景:充大气
      当选择"Ch2"腔室并执行"充大气"操作并确认时
      那么"腔室当前压力"为"760.000"
      并且"蝶阀当前压力"为"760.00"

    场景:抽真空
      当选择"Ch2"腔室并执行"抽真空"操作并确认时
      那么"腔室当前压力"为"1.000E-8"
      并且"蝶阀当前压力"为"0.00"

    场景:物料设定数量成功
      假如选择"Ch2"腔室并执行"设置物料"操作时
      当设置为"1"并确认时
      那么设置成功,且"物料数量"为"1.0"

#    场景:物料设定数量非法输入
#      假如选择"Ch2"腔室并执行"设置物料"操作时
#      当设置为"-1"时
#      那么"物料数量"设定失败，提示信息如下
#      """
#      ='输入超出范围！请输入[0-999999999]范围内的值！'
#      """
#      当设置为"1000000000"时
#      那么"物料数量"设定失败，提示信息如下
#      """
#      ='输入超出范围！请输入[0-999999999]范围内的值！'
#      """
#      当设置为"test"时
#      那么"物料数量"设定失败，提示信息如下
#      """
#      ='非法输入！'
#      """
#      当设置为""时
#      那么"物料数量"设定失败，提示信息如下
#      """
#      ='参数为空！'
#      """

    场景:循环吹扫服务开启成功
      假如选择"Ch2"腔室并执行"充大气"操作并确认时
      当选择"Ch2"腔室并执行"循环吹扫"操作时
      并且设置为"1"并确认时
      那么"腔室当前压力"为"1.000E-8"
      并且"蝶阀当前压力"为"0.00"

#    场景:循环吹扫次数非法输入
#      假如选择"Ch2"腔室并执行"循环吹扫"操作时
#      当设置为"-1"时
#      那么"吹扫次数"设定失败，提示信息如下
#      """
#      ='输入超出范围！请输入[1-9999]范围内的值！'
#      """
#      当设置为"1000000000"时
#      那么"吹扫次数"设定失败，提示信息如下
#      """
#      ='输入超出范围！请输入[1-9999]范围内的值！'
#      """
#      当设置为"test"时
#      那么"吹扫次数"设定失败，提示信息如下
#      """
#      ='非法输入！'
#      """
#      当设置为""时
#      那么"吹扫次数"设定失败，提示信息如下
#      """
#      ='参数为空！'
#      """

    场景:基座位置设定
      假如设备"/Control/Ch2Exports/P24"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Open"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"Home位置位"操作并确认时
      那么"基座当前位置"为"HomePos"
      当选择"Ch2"腔室并执行"工艺位置位"操作并确认时
      那么"基座当前位置"为"ProcessPos1"
      当选择"Ch2"腔室并执行"传片位置位"操作并确认时
      那么"基座当前位置"为"TransferLiftPos"
      当选择"Ch2"腔室并执行"Home位置位"操作并确认时
      那么"基座当前位置"为"HomePos"
      并且工艺腔室"P24"阀门被关闭
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被关闭

      #TODO 关闭服务以及按钮动画是否需要验证？
    场景:开启压升率服务成功
      假如选择"Ch2"腔室并执行"充大气"操作并确认时
      当选择"Ch2"腔室并执行"压升率"操作并确认时
      那么"腔室当前压力"为"1.000E-8"
      并且"蝶阀当前压力"为"0.00"
      并且关闭"压升率"服务

    #TODO 非法输入情况因CI偶发性挂掉暂时阻塞
    场景:基座测试设定成功
      假如设备"/Control/Ch2Exports/P24"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Open"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"基座测试设定"操作时
      并且设置开始位置为"ReleasePosition",结束位置为"ProcessPosition1",测试次数为1,延迟为2s且确认
      那么"基座当前位置"为"ProcessPos1"
      并且工艺腔室"P24"阀门被关闭
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被关闭
      并且结束后"测试总数"为1

    场景:背吹与VacChuck设定(Stabilize压力设定小于50)
      假如设备"/Control/Ch2Exports/P24"为"Close"状态
      并且设备"/Control/Ch2Exports/P01"为"Open"状态
      并且设备"/Control/Ch2Exports/P02"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Close"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定"Stabilize"的压力值为"49"并确认
      那么"背吹设定压力"为"49.0"
      并且"背吹当前压力"为"49.00"
      并且"背吹当前模式"变为"Stabilize"
      并且工艺腔室"P24"阀门被打开
      并且工艺腔室"P1"阀门被关闭
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被打开
      并且工艺腔室"P4"阀门被关闭
      并且"PC01(100)"的AI流量为"49.00"
      并且"PC01(100)"的AO流量为"49.00"

    场景:背吹与VacChuck设定(Stabilize压力设定大于等于50)
      假如设备"/Control/Ch2Exports/P24"为"Close"状态
      并且设备"/Control/Ch2Exports/P01"为"Open"状态
      并且设备"/Control/Ch2Exports/P02"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Open"状态
      并且设备"/Control/Ch2Exports/P04"为"Close"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定"Stabilize"的压力值为"50"并确认
      那么"背吹设定压力"为"50.0"
      并且"背吹当前压力"为"50.00"
      并且"背吹当前模式"变为"Stabilize"
      并且工艺腔室"P24"阀门被打开
      并且工艺腔室"P1"阀门被关闭
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被打开
      并且"PC01(100)"的AI流量为"50.00"
      并且"PC01(100)"的AO流量为"50.00"

    场景:背吹与VacChuck设定(BackSideFlow压力设定小于50)
      假如设备"/Control/Ch2Exports/P24"为"Close"状态
      并且设备"/Control/Ch2Exports/P01"为"Close"状态
      并且设备"/Control/Ch2Exports/P02"为"Close"状态
      并且设备"/Control/Ch2Exports/P03"为"Close"状态
      并且设备"/Control/Ch2Exports/P04"为"Close"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定"BackSideFlow"的压力值为"49"并确认
      那么"背吹设定压力"为"49.0"
      并且"背吹当前压力"为"49.00"
      并且"背吹当前模式"变为"BacksideFlow"
      并且工艺腔室"P24"阀门被打开
      并且工艺腔室"P1"阀门被打开
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被打开
      并且工艺腔室"P4"阀门被关闭
      并且"PC01(100)"的AI流量为"49.00"
      并且"PC01(100)"的AO流量为"49.00"

    场景:背吹与VacChuck设定(BackSideFlow压力设定大于等于50)
      假如设备"/Control/Ch2Exports/P24"为"Close"状态
      并且设备"/Control/Ch2Exports/P01"为"Close"状态
      并且设备"/Control/Ch2Exports/P02"为"Close"状态
      并且设备"/Control/Ch2Exports/P03"为"Close"状态
      并且设备"/Control/Ch2Exports/P04"为"Close"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定"BackSideFlow"的压力值为"50"并确认
      那么"背吹设定压力"为"50.0"
      并且"背吹当前压力"为"50.00"
      并且"背吹当前模式"变为"BacksideFlow"
      并且工艺腔室"P24"阀门被打开
      并且工艺腔室"P1"阀门被打开
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被打开
      并且"PC01(100)"的AI流量为"50.00"
      并且"PC01(100)"的AO流量为"50.00"

    场景:背吹与VacChuck设定(FullChuck)
      假如设备"/Control/Ch2Exports/P24"为"Open"状态
      并且设备"/Control/Ch2Exports/P01"为"Close"状态
      并且设备"/Control/Ch2Exports/P02"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Close"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定为"FullChuck"并确认
      那么"背吹设定压力"为"0"
      并且"背吹当前压力"为"0"
      并且"背吹当前模式"变为"FullChuck"
      并且工艺腔室"P24"阀门被关闭
      并且工艺腔室"P1"阀门被打开
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被打开
      并且工艺腔室"P4"阀门被关闭
      并且"PC01(100)"的AI流量为"0"
      并且"PC01(100)"的AO流量为"0"

    场景:背吹与VacChuck设定(Bypass)
      假如设备"/Control/Ch2Exports/P24"为"Open"状态
      并且设备"/Control/Ch2Exports/P01"为"Close"状态
      并且设备"/Control/Ch2Exports/P02"为"Close"状态
      并且设备"/Control/Ch2Exports/P03"为"Open"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定为"Bypass"并确认
      那么"背吹设定压力"为"0"
      并且"背吹当前压力"为"0"
      并且"背吹当前模式"变为"Bypass"
      并且工艺腔室"P24"阀门被关闭
      并且工艺腔室"P1"阀门被打开
      并且工艺腔室"P2"阀门被打开
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被关闭
      并且"PC01(100)"的AI流量为"0"
      并且"PC01(100)"的AO流量为"0"

    场景:背吹与VacChuck设定(Off)
      假如设备"/Control/Ch2Exports/P24"为"Open"状态
      并且设备"/Control/Ch2Exports/P01"为"Open"状态
      并且设备"/Control/Ch2Exports/P02"为"Open"状态
      并且设备"/Control/Ch2Exports/P03"为"Open"状态
      并且设备"/Control/Ch2Exports/P04"为"Open"状态
      当选择"Ch2"腔室并执行"背吹压力设定"操作时
      并且设定为"Off"并确认
      那么"背吹设定压力"为"0"
      并且"背吹当前压力"为"0"
      并且"背吹当前模式"变为"Off"
      并且工艺腔室"P24"阀门被关闭
      并且工艺腔室"P1"阀门被关闭
      并且工艺腔室"P2"阀门被关闭
      并且工艺腔室"P3"阀门被关闭
      并且工艺腔室"P4"阀门被关闭
      并且"PC01(100)"的AI流量为"0"
      并且"PC01(100)"的AO流量为"0"

    场景:蝶阀压力设定成功
      假如设备"/Control/Ch2Exports/C01"为"Close"状态
      并且设备"/Control/Ch2Exports/C02"为"Open"状态
      当选择"Ch2"腔室并执行"蝶阀压力设定"操作时
      并且设置为"100"并确认时
      那么"蝶阀设定压力"为"100.00"
      并且"蝶阀当前压力"为"100.00"
      并且"腔室当前压力"为"100.000"
      并且"蝶阀当前模式"变为"Pressure"
      并且工艺腔室"C1"阀门被打开
      并且工艺腔室"C2"阀门被关闭

    场景:蝶阀位置设定成功
      假如设备"/Control/Ch2Exports/C01"为"Close"状态
      并且设备"/Control/Ch2Exports/C02"为"Open"状态
      当选择"Ch2"腔室并执行"蝶阀位置设定"操作时
      并且设置为"100"并确认时
      那么"蝶阀设定位置"为"100.00"
      并且"蝶阀当前位置"为"100.00"
      并且"蝶阀当前模式"变为"Position"
      并且工艺腔室"C1"阀门被打开
      并且工艺腔室"C2"阀门被关闭

  Rule:RF相关
    场景:设定功率成功
      假如选择"Ch2"腔室并进入"RF"界面时
      当执行"设定功率"操作后
      并且设置"功率值(W)"为"1000","加载速度(W/s)"为"100"
      那么"设定功率"为"1000.00"
      并且"前向功率"为"1000.00"

    场景:预设Match成功
      当选择"Ch2"腔室并进入"RF"界面时
      并且执行"设定Match"操作后
      并且执行"预设C1/C2"操作后
      并且"预设"C1为"20","预设"C2为"20"
      那么"C1Match"为"20.00"
      并且"C2Match"为"20.00"

    场景:手动设置Match
      当选择"Ch2"腔室并进入"RF"界面时
      并且执行"设定Match"操作后
      并且执行"手调C1/C2"操作后
      并且"手调"C1为"200","手调"C2为"400"
      那么"C1Match"为"200.00"
      并且"C2Match"为"400.00"

    场景:关闭电源
      假如选择"Ch2"腔室并进入"RF"界面时
      当设定为"关闭电源"并确认
      那么"设定功率"为"0"
      并且"前向功率"为"0"

    #TODO 非法输入校验场景目前因CI出现原因不明会偶发性挂掉的情况暂时不加入CI验证