# language: zh-CN
@etch1ref-lower
@cleanLogDir
@etch1-ui
@reset-feature-ui
#@skip
功能: eventLot

  场景: 导出Jobs失败
    当执行Jobs导出
    那么执行失败,异常信息为:
    """
    = "The jobs query table has no data,export failed!"
    """

  场景: 导出Slot失败
    当执行Slot导出
    那么执行失败,异常信息为:
    """
    = "The table has no data,export failed!"
    """

  场景: 基础查询
    假如有事件日志包括:
      | Day        | Time     | LotID |
      | 2022-12-10 | 10:00:00 | 1     |
      | 2022-12-10 | 10:10:00 | 1     |
      | 2022-12-11 | 10:00:00 | 1     |
      | 2022-12-12 | 10:00:00 | 2     |
      | 2022-12-12 | 10:10:00 | 1     |
    当查询"2022/12/10"至"2022/12/12"的手动事件日志时
    那么查询手动事件日志结果为:
    """
    =[
      ['2022-12-10','1','10:00:00','10:00:00']
      ['2022-12-10','1','10:10:00','10:10:00']
      ['2022-12-11','1','10:00:00','10:00:00']
      ['2022-12-12','2','10:00:00','10:00:00']
      ['2022-12-12','1','10:10:00','10:10:00']
    ]
    """

  场景: 日期差异查询
    假如有事件日志包括:
      | Day        | Time     | LotID |
      | 2022-12-10 | 10:00:00 | 1     |
      | 2022-12-10 | 10:10:00 | 1     |
      | 2022-12-11 | 10:00:00 | 1     |
      | 2022-12-12 | 10:00:00 | 2     |
      | 2022-12-12 | 10:10:00 | 1     |
    当查询"2022/12/11"至"2022/12/12"的手动事件日志时
    那么查询手动事件日志结果为:
      """
      =[
        ['2022-12-11','1','10:00:00','10:00:00']
        ['2022-12-12','2','10:00:00','10:00:00']
        ['2022-12-12','1','10:10:00','10:10:00']
      ]
      """

  场景: 空查询
    假如有事件日志包括:
      | Day        | Time     | LotID |
      | 2022-12-10 | 10:00:00 | 1     |
      | 2022-12-10 | 10:10:00 | 1     |
      | 2022-12-11 | 10:00:00 | 1     |
      | 2022-12-12 | 10:00:00 | 2     |
      | 2022-12-12 | 10:10:00 | 1     |
    当查询"2022/12/09"至"2022/12/09"的手动事件日志时
    那么查询手动事件日志结果为:
      """
      =[]
      """

  场景:时间区间错误查询
    当查询"2022/12/13"至"2022/12/12"的手动事件日志时
    那么执行失败,异常信息为:
      """
      = "This start time is later than end time, please input again!"
      """

  场景: 单晶圆Job日志信息核对
    假如有单个晶圆被执行的自动工作日志:
      | FileID | LotID | CJobID | Day        | startTime           | endTime             | inputFoup | outFoup | definedWafer | waferid | wafername | waferstatus | slot | flowname | statuserror | chamber | recipe  | starttime           | endtime             | alignangle |
      | 1      | 1     | 1      | 2022-12-13 | 2022/12/13 10:00:00 | 2022/12/13 10:10:00 | P1        | P1      | P1_1         | 1       | P1_1      | 1           | 1    | FileFlow | 0           | PM2     | Filercp | 2022-12-13 10:01:00 | 2022-12-13 10:09:00 | 0          |
    并且有晶圆单步工艺步骤记录:
      | FileID | wafername | LotID | recipe  | chamber | StepName | stepstartTime       | stependTime         | stepAddress | stepProcessTime | stepEndBy | EPDType | EPDTime | Error | Day        |
      | 1      | P1_1      | 1     | Filercp | PM2     | dechuck  | 2022/12/13 10:02:00 | 2022/12/13 10:02:20 | 1/1         | 20              | Time      | IEP     | 20      | 0     | 2022-12-13 |
    并且有FileID为1的晶圆流动路径记录:
      | time                | wafername | flowFrom   | flowTo     | Day        | LotID |
      | 2022/12/13 10:02:02 | P1_1      | P1_1       | VACRobot_1 | 2022-12-13 | 1     |
      | 2022/12/13 10:02:05 | P1_1      | VACRobot_1 | P1_1       | *          | *     |
    当查询"2022/12/13"至"2022/12/13"的自动事件日志时
    那么查询自动事件日志结果为
      """
      =[
        ['2022-12-13','1','10:00:00','10:10:00','P1','P1']
      ]
      """
    当打开日志Job信息时
    那么日志Job晶圆信息为:
      """
      =[
        ['slot-01','P1_1','1','FileFlow','1','0','PM2','Filercp','10:01:00','10:09:00','0']
      ]
      """
    当打开日志Job晶圆信息时
    那么日志Job晶圆步骤信息为:
      """
      =[
        ['dechuck','10:02:00','10:02:20','1/1','20','Time','IEP','20','0:']
      ]
      """
    那么日志Job晶圆流动路径信息为:
      """
      =[
        ['2022-12-13 10:02:02','P1_slot1 to VACRobot_slot1']
        ['2022-12-13 10:02:05','VACRobot_slot1 to P1_slot1']
      ]
      """
