# language: zh-CN
@skip
@clean-lower-route
功能:job界面
  Rule:test
    场景:test
      假如存在"Route":
        | name   |
        | route2 |
      假如存在"Job":
        | name | routes[0].route | routes[0].slots | src | dest | mode | isunload | cyclenum | isprocess | ishigh | createtime          | modifytime          |
        | job2 | route2          | 1,2             | LP1 | LP1  | 串行模式 | 1        | 1        | 1         | 0      | 2000-01-01T00:00:00 | 2000-01-01T00:00:00 |

  Rule:新建
    场景: 新建一个job,查看任务名称中是否有
      当用户"pe"使用密码"8888"启动上位机
      那么新建任务"job"
      那么任务名称列表返回如下:
      """
      : [
          {
            任务名称: job
          }
        ]
      """

    场景:新建使用相同slot的job
      假如存在"Route":
        | name   |
        | route1 |
        | route2 |
      当用户"pe"使用密码"8888"启动上位机
      并且新建使用相同的槽位任务如下:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        },{
          "route": "route2",
          "slots":"1"
        }],
        "src": "LP1",
        "dest": "LP1",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      那么提示信息为:
      """
      = "Slot1被路径route1和route2同时占用！请检查！"
      """

    场景:新建的任务在编辑状态下，再次新建任务有提示信息未保存当前路径
      假如存在"Route":
        | name   |
        | route1 |
      当用户"pe"使用密码"8888"启动上位机
      并且新建任务如下:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP1",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当再次新建任务时
      那么提示信息为:
      """
      = "有尚未保存的Job信息：job1，是否保存？"
      """

    场景: 创建路径时,不选择路径和槽位,再次新建路径
      当用户"pe"使用密码"8888"启动上位机
      并且不选择路径和槽位创建任务:
      """
      {
        "name": job1,
        "src": "LP1",
        "dest": "LP1",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当再次新建任务时
      并且保存未保存的任务时
      那么提示信息为:
      """
      = "任务'job1'保存失败，原因：工艺路径/槽位配置有误，请检查！"
      """

    场景: 创建路径时,不选择起始片盒和目的片盒,再次新建路径
      假如存在"Route":
        | name   |
        | route1 |
      当用户"pe"使用密码"8888"启动上位机
      并且不选择起始片盒和目的片盒创建任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当再次新建任务时
      并且保存未保存的任务时
      那么提示信息为:
      """
      = "任务'job1'保存失败，原因：起始片盒/目的片盒为空，请选择！"
      """

    场景: 创建路径时,输入非法的提示信息,再次新建路径时有提示信息
      假如存在"Route":
        | name   |
        | route1 |
      当用户"pe"使用密码"8888"启动上位机
      并且不选择起始片盒和目的片盒创建任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP1",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "0"
      }
      """
      当再次新建任务时
      那么提示信息为:
      """
      = "请输入1-999范围内的正整数！"
      """

    场景:新建的任务在编辑状态下，再次新建任务，不保存当前任务，检查任务列表
      假如存在"Route":
        | name   |
        | route1 |
      当用户"pe"使用密码"8888"启动上位机
      并且不选择起始片盒和目的片盒创建任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当再次新建任务时
      并且不保存未保存的任务时
      那么任务名称列表返回如下:
      """
      = [

        ]
      """

    场景: 新建任务当没有路径选择槽位时，有提示信息
      假如用户"pe"使用密码"8888"启动上位机
      并且不选择路径创建任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP1",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      那么提示信息为:
      """
      = "请先选择路径！"
      """

    场景: 新建的任务起始片盒和目的片盒不同时，有提示信息
      假如用户"pe"使用密码"8888"启动上位机
      当创建起始片盒和目的片盒不同的任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP2",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      那么提示信息为:
      """
      = "目的片盒与起始片盒不一致，是否要保持一致？"
      """

    场景: 新建的任务起始片盒和目的片盒不同时，选择保持一致
      假如用户"pe"使用密码"8888"启动上位机
      并且创建起始片盒和目的片盒不同的任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP2",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当将起始片盒和目的片盒保持一致时
      那么起始片盒为:
      """
      = "LP1"
      """
      并且目的片盒为:
      """
      = "LP1"
      """

    场景: 新建的任务起始片盒和目的片盒不同时，选择不保持一致
      假如用户"pe"使用密码"8888"启动上位机
      并且创建起始片盒和目的片盒不同的任务:
      """
      {
        "name": job1,
        "jobDetail": [{
          "route": "route1",
          "slots": "1"
        }],
        "src": "LP1",
        "dest": "LP2",
        "mode": "串行模式",
        "action": "卸载片盒",
        "cyctime": "1"
      }
      """
      当将起始片盒和目的片盒不保持一致时
      那么起始片盒为:
      """
      = "LP1"
      """
      并且目的片盒为:
      """
      = "LP2"
      """

